constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    symmetryX
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          143;
        startFace       25507;
    }
    symmetryY
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          143;
        startFace       25650;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12870;
        startFace       25793;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12870;
        startFace       38663;
    }
    innerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       51533;
    }
    outerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       51623;
    }
)

// ************************************************************************* //
