0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T.orig;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    symmetryX
    {
        type            symmetryPlane;
    }
	
	symmetryY
	{
		type			symmetryPlane;
	}

	innerWall
	{
		type	zeroGradient;
	}

	outerWall
	{
		type	zeroGradient;
	}

    front
    {
        type            empty;
    }
	
	back
	{
		type	empty;
	}
}


// ************************************************************************* //
